[
  {
    "id": 1,
    "title": "JavaScript Essentials",
    "author": "Johnny Bock",
    "description": "viverra eget congue eget semper rutrum nulla nunc purus phasellus in felis donec semper sapien a libero nam dui proin leo odio porttitor id consequat in consequat ut",
    "category": "JavaScript",
    "price": 80
  },
  {
    "id": 2,
    "title": "Professional JavaScript for Web Developers 4th Edition",
    "author": "Clara Richardsson",
    "description": "vestibulum quam sapien varius ut blandit non interdum in ante vestibulum ante ipsum primis in faucibus orci luctus et ultrices posuere cubilia curae duis faucibus accumsan odio curabitur convallis duis consequat dui nec nisi volutpat eleifend donec ut dolor morbi vel lectus in quam fringilla rhoncus mauris enim leo",
    "category": "JavaScript",
    "price": 226
  },
  {
    "id": 3,
    "title": "Eloquent JavaScript, 3rd Edition: A Modern Introduction to Programming",
    "author": "Averil Quiney",
    "description": "consequat lectus in est risus auctor sed tristique in tempus sit amet sem fusce consequat nulla nisl nunc",
    "category": "JavaScript",
    "price": 310
  },
  {
    "id": 4,
    "title": "JavaScript for Complete Beginners: A Step by Step Self-Teaching Guide for Learners Completely New to Programming",
    "author": "Brunhilda Clemmitt",
    "description": "semper rutrum nulla nunc purus phasellus in felis donec semper sapien a libero nam dui proin leo odio porttitor id consequat in consequat ut nulla sed accumsan felis ut at dolor quis odio consequat varius integer ac leo pellentesque ultrices mattis odio donec",
    "category": "JavaScript",
    "price": 447
  },
  {
    "id": 5,
    "title": "JavaScript Crash Course",
    "author": "Viviana Wiffill",
    "description": "consequat ut nulla sed accumsan felis ut at dolor quis odio",
    "category": "JavaScript",
    "price": 246
  },
  {
    "id": 6,
    "title": "HTML in easy steps",
    "author": "Claiborne Hurdidge",
    "description": "justo aliquam quis turpis eget elit sodales scelerisque mauris sit amet eros suspendisse accumsan tortor quis turpis sed ante vivamus tortor duis mattis egestas metus aenean fermentum donec ut mauris eget",
    "category": "HTML",
    "price": 101
  },
  {
    "id": 7,
    "title": "Web Developer Front-end HTML (Hyper Text Markup Language)",
    "author": "Carleen Benson",
    "description": "sapien non mi integer ac neque duis bibendum morbi non quam nec dui luctus rutrum nulla tellus in sagittis dui vel nisl duis",
    "category": "HTML",
    "price": 189
  },
  {
    "id": 8,
    "title": "HTML Programming For Beginners: Answers all your Questions Step-by-Step",
    "author": "Balduin Dando",
    "description": "nisl venenatis lacinia aenean sit amet justo morbi ut odio cras mi pede malesuada in imperdiet et commodo vulputate justo in blandit",
    "category": "HTML",
    "price": 486
  },
  {
    "id": 9,
    "title": "Fundamentos de HTML y CSS: Aprende a crear páginas web",
    "author": "Cariotta Giddings",
    "description": "dui proin leo odio porttitor id consequat in consequat ut nulla sed accumsan felis ut at dolor quis odio consequat varius integer ac leo pellentesque ultrices mattis",
    "category": "CSS",
    "price": 497
  },
  {
    "id": 10,
    "title": "An Introduction to HTML",
    "author": "May Barajas",
    "description": "nulla ultrices aliquet maecenas leo odio condimentum id luctus nec molestie sed justo pellentesque viverra pede ac diam cras pellentesque volutpat dui maecenas tristique est et tempus semper est quam pharetra magna ac consequat metus sapien ut nunc vestibulum ante ipsum primis",
    "category": "HTML",
    "price": 372
  },
  {
    "id": 11,
    "title": "CSS in Depth",
    "author": "Brande Seeley",
    "description": "posuere nonummy integer non velit donec diam neque vestibulum eget vulputate ut ultrices vel augue vestibulum ante ipsum primis in faucibus orci luctus et ultrices posuere cubilia curae donec pharetra magna vestibulum aliquet ultrices erat tortor sollicitudin mi sit amet lobortis sapien sapien non mi",
    "category": "CSS",
    "price": 376
  },
  {
    "id": 12,
    "title": "Modern CSS: Master the Key Concepts of CSS for Modern Web Development",
    "author": "Martha Thor",
    "description": "eleifend quam a odio in hac habitasse platea dictumst maecenas ut massa quis augue luctus tincidunt nulla mollis molestie lorem quisque ut erat curabitur gravida nisi at nibh in hac habitasse platea dictumst aliquam augue quam sollicitudin vitae consectetuer eget rutrum at lorem integer tincidunt ante vel ipsum praesent blandit",
    "category": "CSS",
    "price": 352
  },
  {
    "id": 13,
    "title": "CSS for Beginners: A Fun and Easy Introduction to Cascading Style Sheets: Learn how to style your HTML",
    "author": "Herta Hiddsley",
    "description": "et ultrices posuere cubilia curae duis faucibus accumsan odio curabitur convallis duis consequat dui nec nisi volutpat eleifend donec ut dolor",
    "category": "CSS",
    "price": 235
  },
  {
    "id": 14,
    "title": "CSS Master 3e",
    "author": "Florri Oakley",
    "description": "rhoncus aliquet pulvinar sed nisl nunc rhoncus dui vel sem sed sagittis nam congue risus semper porta volutpat quam pede lobortis ligula sit amet eleifend pede libero quis orci nullam molestie nibh in lectus",
    "category": "HTML",
    "price": 115
  },
  {
    "id": 15,
    "title": "Learn CSS: 100+ Coding Q&A",
    "author": "Wyatt Golsworthy",
    "description": "vestibulum sed magna at nunc commodo placerat praesent blandit nam nulla integer pede justo lacinia eget tincidunt eget tempus vel pede morbi porttitor lorem id ligula suspendisse ornare consequat lectus in est risus auctor sed",
    "category": "CSS",
    "price": 385
  },
  {
    "id": 16,
    "title": "Strategic Writing for UX: Drive Engagement, Conversion, and Retention with Every Word",
    "author": "Fay Basilio",
    "description": "convallis morbi odio odio elementum eu interdum eu tincidunt in leo maecenas pulvinar lobortis est phasellus sit amet erat nulla tempus vivamus in felis eu sapien cursus vestibulum proin eu mi nulla ac enim in tempor turpis nec euismod scelerisque quam turpis",
    "category": "UX",
    "price": 296
  },
  {
    "id": 17,
    "title": "Laws of UX: Using Psychology to Design Better Products & Services",
    "author": "Hastings Borghese",
    "description": "diam cras pellentesque volutpat dui maecenas tristique est et tempus semper est quam pharetra magna ac consequat metus sapien ut nunc vestibulum ante ipsum primis in faucibus orci luctus et ultrices posuere cubilia curae mauris viverra diam vitae quam suspendisse",
    "category": "UX",
    "price": 306
  },
  {
    "id": 18,
    "title": "UX Methods: A Quick Guide to User Experience Research Methods",
    "author": "Gilbert Aldrick",
    "description": "erat vestibulum sed magna at nunc commodo placerat praesent blandit nam nulla integer pede justo lacinia eget tincidunt eget tempus vel pede morbi porttitor lorem id ligula suspendisse",
    "category": "UX",
    "price": 489
  },
  {
    "id": 19,
    "title": "UX For Dummies",
    "author": "Ophelia Vowles",
    "description": "ridiculus mus etiam vel augue vestibulum rutrum rutrum neque aenean auctor gravida sem praesent id",
    "category": "UX",
    "price": 186
  },
  {
    "id": 20,
    "title": "UX Research: Practical Techniques for Designing Better Products",
    "author": "Christabella Snelling",
    "description": "sapien non mi integer ac neque duis bibendum morbi non quam nec dui luctus rutrum nulla tellus in sagittis dui vel nisl duis ac nibh fusce lacus purus aliquet at feugiat non pretium quis lectus suspendisse potenti in eleifend quam a odio in hac",
    "category": "UX",
    "price": 391
  },
  {
    "id": 21,
    "title": "HTML - an introduction",
    "author": "Stephan Hek",
    "description": "This webpage is made using HTML which stands for HyperText Markup Language. HTML is as the name implies a markup language used to structure text data and related elements. Currently it is the standard way of presenting information and documents on the internet.<br><br><b>History</b><br>HTML was created by a contractor working at CERN; Tim Berners-Lee. Initially HTML was designed as a uniform way to  easily share and use documents between CERN researchers. A first prototype was made by Berners-Lee in 1990. Unfortunately this idea was not implemented within CERN.<br><br>Berners-Lee continued working on his idea and HTML 1.0 was released publicly in 1993 as a way to share data uniformly via web browsers. Given the lack in actual websites at the time this version did not gain a lot of traction. On subsequent versions and with the rise of internet use HTML came to be widely used and was implemented as an international standard (ISO) in 2000.<br><br><b>Syntax</b><br>HTML uses tags to define how specific types of a document are implemented or visualised. This can be simple things like paragraph-types and headers to more complicated things like images, links and even scripting components. By using these tags and also by standardising how these tags should function/operate, a webbrowser can easily interpret a HTML document. Such a document could also be visualised as a tree structure whereby each HTML attribute or element can function as a node. This concept is called DOM (document object model).  Structuring the data is such a way makes it easily accessible for other programs or computer languages.<br><br><b>Versions</b><br>The HTML language has evolved over the years and has gotten more and more capabilities. At first only text related features were available. Over time more elements were added such as style options (CSS) and scripting components (Javascript).<br><br>Currently HTML5 is the standard version and has made web development even more standardised. With the possibility of integrating video and audio content and other interactive features within HTML it is no longer required to install specific plugins (for instance Adobe Flash). ",
    "category": "HTML",
    "price": 1000
  },
  {
    "id": 22,
    "title": "CSS - an introduction",
    "author": "Stephan Hek",
    "description": "CSS, which stands for Cascading Style Sheets, is a language invented specifically for styling documents written in a markup language. It is therefore almost always used in conjunction with HTML. CSS and HTML function in a synergy whereby CSS is responsible for the presentation of information and the actual information is described using the HTML language.<br><br>By separating the presentation and content in seperate parts flexibility is created. Styles can easily be adjusted or styles can be copied to different content. CSS is build such that minimal code is used to create the visualisation one aspires. This saves time in creating content and prevents accidental mistakes as most visualisation features only have to be specified once. Style adjustments are therefore implemented uniformly. <br><br><b>History</b><br>CSS was invented by Håkon Wium Lie, a colleague of Tim Berners-Lee who was the inventor of the markup language HTML. The idea of Håkon was not the first style language but the distinctive feature of his language was the possibility of combining various style sheets of other sources. It was realised in 1996 and gained traction slowly as not all browsers at that time could implement CSS concepts correctly. Adoption of CSS has been improved over the years by standardisation efforts like that of W3C.<br><br><b>Syntax</b><br>CSS uses one or more stylesheets which contains formatting rules for specific elements in a markup language like HTML. One can think of simple visualisation options such as font-size and colour but also more complex ones like how elements are visualised when their state changes (active or diabled states or when a mouse hovers over it).<br><br>CSS is written in such a way that it tries to minimise the number of coding  lines necessary to create nice visualisations. One way it does this is by inheritance. This means if no specific styling options are specified for an element it copies the visualisation of its parent element. Another feature is the way how the styling sheet is compiled; from top to bottom. The style rules stated above can be further specified or overruled for certain elements in style rules further down in the styling sheet. This prevents a lot of double coding lines. ",
    "category": "CSS",
    "price": 1000
  },
  {
    "id": 23,
    "title": "JavaScript - an introduction",
    "author": "Stephan Hek",
    "description": "Javascript is a program language used in conjunction with HTML and CSS. It is the dominant programming language for web technologies. It used by almost all websites on the front end part and additionally is being used more on the back-end side as well as a result of new advances such as node.js. Node.js is a runtime environment that makes it possible to run javascript applications outside a webbrowser.<br><br><b>History</b><br>In the early days of the internet all webpages were static lacking any dynamic features. A new programming language was developed to tackle this issue; Javascript. Created in 1995 by Brendan Eich employed at the time by Netscape which was at that time the most popular webbrowser. The name coined for this new language was chosen mainly for marketing reasons as in those days the programming language Java was well known and popular.<br><br><b>Syntax</b><br>Javascript is a scripting language meaning it is run on runtime without the need to compile it before executation. Javascript uses dynamic typing whereby an attribute can change type based on the value it takes or when explicitly changed to a certain type by the programmer. Furthermore attributes can change types when used in conjunction with certain operators. It is therefore a much more dynamic and loose language compared to Java or C++. Javascript also uses objects which is defined as an array containing key values. Furthermore a function is also seen as an object and can be used as such. It can for instance be included in an object element.<br><br>In conjunction with javascript some other auxiliary programming concepts were developed. An important one is JSON which is a standardised object notation system used to standardise data so that it can be interpreted more easily and described in a more uniform way. Another concept is Typescript which is a variant of Javascript. It tries to present/format the Javascript code in a more formal way by introducing type annotations for functions and attributes. ",
    "category": "JavaScript",
    "price": 1000
  }
]